{"products": [
    {
        "product_id": "1",
        "name": "Frankenstein",
        "author": "Mary Shelley",
        "description": "Obsessed by creating life itself, Victor Frankenstein plunders graveyards for the material to fashion a new being, which he shocks into life by electricity. But his botched creature, rejected by Frankenstein and denied human companionship, sets out to destroy his maker and all that he holds dear. This chilling gothic tale, begun when Mary Shelley was just nineteen years old, would become the world's most famous work of horror fiction, and remains a devastating exploration of the limits of human creativity.etc",
        "image": "https://image.bokus.com/images/9780141439471_383x_frankenstein_haftad",
        "price": "99",
        "sale": false,
        "discounted_price": "70"
    },
    {
        "product_id": "2",
        "name": "The Secret History",
        "author": "Donna Tartt",
        "description": "Under the influence of a charismatic classics professor, a group of clever, eccentric misfits at a New England college discover a way of thought and life a world away from their banal contemporaries. But their search for the transcendent leads them down a dangerous path, beyond human constructs of morality.",
        "image": "https://image.bokus.com/images/9780140167771_383x_the-secret-history_haftad",
        "price": "149",
        "sale": true,
        "discounted_price": "104"
    },
    {
        "product_id": "3",
        "name": "Dance Dance Dance",
        "author": "Murakami",
        "description": "Combining an offbeat cast of characters with Murakami's idiosyncratic prose, this novel is an assault on all the senses, a murder mystery that is also philosophical speculation, and a dark fable of advanced capitalism.",
        "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1320549978i/334598.jpg",
        "price": "129",
        "sale": true,
        "discounted_price": "79"
    },
    {
        "product_id": "4",
        "name": "No longer human",
        "author": "Osamu Dazai",
        "description": "Oba Yozo's attempts to reconcile himself to the world around him begin in early childhood, continue through high school, where he becomes a clown to mask his alienation, and eventually lead to a failed suicide attempt as an adult. Without sentimentality, he records the casual cruelties of life and its fleeting moments of human connection and tenderness.",
        "image": "https://s2.adlibris.com/images/1431493/no-longer-human.jpg",
        "price": "99",
        "sale": true,
        "discounted_price": "56"
    },
    {
        "product_id": "5",
        "name": "Moby Dick",
        "author": "Herman Melville",
        "description": "Moby Dick is the story of Captain Ahab’s quest to avenge the whale that ‘reaped’ his leg. The quest is an obsession and the novel is a diabolical study of how a man becomes a fanatic. But it is also a hymn to democracy. Bent as the crew is on Ahab’s appalling crusade, it is equally the image of a co-operative community at work: all hands dependent on all hands, each individual responsible for the security of each.",
        "image": "https://image.bokus.com/images/9781840228304_383x_moby-dick",
        "price": "99",
        "sale": false,
        "discounted_price": "79"
    },
    {
        "product_id": "6",
        "name": "White Nights",
        "author": "Fyodor Dostoevsky",
        "description": "My God! A whole minute of bliss! Is that really so little for the whole of a man's life?",
        "image": "https://image.bokus.com/images/9780241252086_383x_white-nights_haftad",
        "price": "99",
        "sale": false,
        "discounted_price": "49"
    },
    {
        "product_id": "7",
        "name": "To the Lighthouse",
        "author": "Virginia Woolf",
        "description": "Every summer, the Ramsays visit their summer home on the beautiful Isle of Skye, surrounded by the excitement and chatter of family and friends, mirroring Virginia Woolf’s own joyful holidays of her youth. But as time passes, and in its wake the First World War, the transience of life becomes ever more apparent through the vignette of the thoughts and observations of the novel’s disparate cast",
        "image": "https://image.bokus.com/images/9781847496577_383x_to-the-lighthouse_haftad",
        "price": "109",
        "sale": false,
        "discounted_price": "79"
    },
    {
        "product_id": "8",
        "name": "Middlemarch",
        "author": "George Eliot",
        "description": "She did not know then that it was Love who had come to her briefly as in a dream before awaking, with the hues of morning on his wings - that it was Love to whom she was sobbing her farewell as his image was banished by the blameless rigour of irresistible day'",
        "image": "https://image.bokus.com/images/9780141199795_383x_middlemarch_haftad",
        "price": "159",
        "sale": false,
        "discounted_price": "109"
    }
    ]
}